<h1><font color='Blue' size=33><b>Biblioteca Pandas</font></b>

**Séries**

In [1]:
import numpy as np
import pandas as pd

In [2]:
etiquetas = ['a', 'b', 'c']
dados = [15, 20, 30]

In [3]:
serie = pd.Series(data=dados, index=etiquetas)
serie

a    15
b    20
c    30
dtype: int64

In [4]:
array = np.arange(3,6)
serie2 = pd.Series(array)
serie2

0    3
1    4
2    5
dtype: int32

In [5]:
dados_index = ['dados1', 'dados2', 'dados3']
serie2 = pd.Series(array, dados_index)
serie2

dados1    3
dados2    4
dados3    5
dtype: int32

In [6]:
serie2['dados2']

4

In [7]:
dicionario = dict({"A": 1, "B": 2, "C": 3, "D": 4, "E": 5})
dados4 = pd.Series(dicionario)
dados4

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [8]:
for lista in dados4:
    print(lista)

1
2
3
4
5

In [9]:
info = dados4.index[4]
info

'E'

In [10]:
dados4[info]

5

In [11]:
entrada = "E"
x = 0;


while x < len(dados4):
    info = dados4.index[x]
    if(info == entrada):
        posicao = dados4[info]
    x += 1
posicao

5

**DataFrame**

In [12]:
linhas = ["linha1","linha2", "linha3"]
colunas = ["cluna1","coluna2", "coluna3"]
dados = [[123, 456,789], [444, 555, 666], [555, 777, 888]]

dataframe = pd.DataFrame(dados, linhas, colunas)
dataframe

        cluna1  coluna2  coluna3
linha1     123      456      789
linha2     444      555      666
linha3     555      777      888

In [13]:
dataframe.loc['linha1']

cluna1     123
coluna2    456
coluna3    789
Name: linha1, dtype: int64

In [14]:
info = dataframe.index[0]

In [15]:
lista = np.array(dataframe.loc[info])
lista

array([123, 456, 789], dtype=int64)

In [16]:
entrada = 789
for x in lista:
    if(x == entrada):
        print(x)

789

In [17]:
dataframe.loc['linha3']['coluna2']

777

In [18]:
dataframe['soma total'] = dataframe['cluna1'] + dataframe['coluna2'] + dataframe['coluna3']
dataframe

        cluna1  coluna2  coluna3  soma total
linha1     123      456      789        1368
linha2     444      555      666        1665
linha3     555      777      888        2220

In [19]:
dataframe.drop('soma total', axis=1)

        cluna1  coluna2  coluna3
linha1     123      456      789
linha2     444      555      666
linha3     555      777      888

In [20]:
dataframe

        cluna1  coluna2  coluna3  soma total
linha1     123      456      789        1368
linha2     444      555      666        1665
linha3     555      777      888        2220

In [21]:
dataframe.drop('soma total', axis=1, inplace=True)
dataframe

        cluna1  coluna2  coluna3
linha1     123      456      789
linha2     444      555      666
linha3     555      777      888

**Condição**

In [22]:
dataframe['soma total'] = dataframe['cluna1'] + dataframe['coluna2'] + dataframe['coluna3']
dataframe

        cluna1  coluna2  coluna3  soma total
linha1     123      456      789        1368
linha2     444      555      666        1665
linha3     555      777      888        2220

In [23]:
condicao = dataframe['soma total'] > 2000
condicao

linha1    False
linha2    False
linha3     True
Name: soma total, dtype: bool

In [24]:
dataframe[condicao]

        cluna1  coluna2  coluna3  soma total
linha3     555      777      888        2220

In [25]:
condicao = (dataframe['cluna1']  > 200 ) & (dataframe['coluna3'] < 800 )
condicao

linha1    False
linha2     True
linha3    False
dtype: bool

In [26]:
dataframe[condicao]

        cluna1  coluna2  coluna3  soma total
linha2     444      555      666        1665

In [27]:
dataframe[condicao][['cluna1', 'coluna2']]

        cluna1  coluna2
linha2     444      555

**Modificando o nome das Linha**

In [28]:
nova_linha = 'Dia 1, Dia 2, Dia 3'.split(',')
nova_linha

['Dia 1', ' Dia 2', ' Dia 3']

In [29]:
dataframe['Dias'] = nova_linha
dataframe

        cluna1  coluna2  coluna3  soma total    Dias
linha1     123      456      789        1368   Dia 1
linha2     444      555      666        1665   Dia 2
linha3     555      777      888        2220   Dia 3

In [30]:
dataframe.set_index('Dias')

        cluna1  coluna2  coluna3  soma total
Dias
Dia 1      123      456      789        1368
 Dia 2     444      555      666        1665
 Dia 3     555      777      888        2220

In [31]:
dataframe

        cluna1  coluna2  coluna3  soma total    Dias
linha1     123      456      789        1368   Dia 1
linha2     444      555      666        1665   Dia 2
linha3     555      777      888        2220   Dia 3

In [32]:
dataframe = dataframe.set_index('Dias')

In [33]:
dataframe

        cluna1  coluna2  coluna3  soma total
Dias
Dia 1      123      456      789        1368
 Dia 2     444      555      666        1665
 Dia 3     555      777      888        2220

**Tratamento de Dados e Valores Nulos**

In [34]:
dicionario = {'A':[4, 5, np.nan], 'B':[6, 1, 5], 'C':[np.nan, 4, np.nan]}
dicionario

{'A': [4, 5, nan], 'B': [6, 1, 5], 'C': [nan, 4, nan]}

In [35]:
dataframe = pd.DataFrame(dicionario)
dataframe

     A  B    C
0  4.0  6  NaN
1  5.0  1  4.0
2  NaN  5  NaN

In [36]:
dataframe.dropna()

     A  B    C
1  5.0  1  4.0

In [37]:
dataframe.dropna(axis=1)

   B
0  6
1  1
2  5

In [38]:
dataframe.fillna(value=0)

     A  B    C
0  4.0  6  0.0
1  5.0  1  4.0
2  0.0  5  0.0

In [39]:
valor_medio = dataframe.mean()
valor_medio

A    4.5
B    4.0
C    4.0
dtype: float64

In [40]:
dataframe.fillna(value=valor_medio)

     A  B    C
0  4.0  6  4.0
1  5.0  1  4.0
2  4.5  5  4.0

**Agrupamento de Dados**

In [41]:
dicionario = {'Dias':['Dia 1', 'Dia 2', 'Dia 1', 'Dia 2', 'Dia 3'], 'Vendedores': ['Pedro', 'Marcelo', 'augusto', 'Ricardo', 'José'],
        'Vendas': [100, 200, 300, 650, 550]}

In [42]:
dicionario

{'Dias': ['Dia 1', 'Dia 2', 'Dia 1', 'Dia 2', 'Dia 3'],
 'Vendedores': ['Pedro', 'Marcelo', 'augusto', 'Ricardo', 'José'],
 'Vendas': [100, 200, 300, 650, 550]}

In [43]:
dataframe = pd.DataFrame(dicionario)
dataframe

    Dias Vendedores  Vendas
0  Dia 1      Pedro     100
1  Dia 2    Marcelo     200
2  Dia 1    augusto     300
3  Dia 2    Ricardo     650
4  Dia 3       José     550

In [44]:
dataframe.groupby('Dias').mean()

       Vendas
Dias
Dia 1     200
Dia 2     425
Dia 3     550

In [45]:
dataframe.groupby('Dias').sum()

       Vendas
Dias
Dia 1     400
Dia 2     850
Dia 3     550

In [46]:
dataframe.groupby('Dias').describe()

      Vendas
       count   mean         std    min    25%    50%    75%    max
Dias
Dia 1    2.0  200.0  141.421356  100.0  150.0  200.0  250.0  300.0
Dia 2    2.0  425.0  318.198052  200.0  312.5  425.0  537.5  650.0
Dia 3    1.0  550.0         NaN  550.0  550.0  550.0  550.0  550.0

**Combinando DataFrames**

In [47]:
dicionario = {'A':[1,2,3], 'B':[4,5,6,], 'C':[7,8,9]}

In [48]:
dataframe1 = pd.DataFrame(dicionario)
dataframe1

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [49]:
dicionario2 = {'A':[1,2,3], 'B':[4,5,6,], 'C':[7,8,9]}

In [50]:
dataframe2 = pd.DataFrame(dicionario2)
dataframe2

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [51]:
pd.concat([dataframe1, dataframe2])

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9
0  1  4  7
1  2  5  8
2  3  6  9

In [58]:
pd.concat([dataframe1, dataframe2], axis=1)

   A  B  C  A  B  C
0  1  4  7  1  4  7
1  2  5  8  2  5  8
2  3  6  9  3  6  9